<?php
/* 
    [QXDream] Copyright (C)2010-2011 QXDream Mutiuser
	
    @homepage http://www.qxhtml.cn 倾行博客
	@author   踏雪残情 <xuexian_123@163.com>
	
	@create   2011-04-07 后台模组资源模型 $
	@version  $Id: MrModel.class.php 1.0 2011-04-10
*/

defined('IN_QX') or die('<h1>Forbidden!</h1>');

class MrModel extends Model {
	public $table;
	
	/**
	+-----------------------------------------------------------------------
	* 初始化数据
	+-----------------------------------------------------------------------
	* 参数     无
	+-----------------------------------------------------------------------
	* 返回值   无
	+-----------------------------------------------------------------------
	*/
	public function _initialize() {
		$this->set();
	}
	
	/**
	+-----------------------------------------------------------------------
	* 初始模组信息
	+-----------------------------------------------------------------------
	* 参数     无
	+-----------------------------------------------------------------------
	* 返回值   无
	+-----------------------------------------------------------------------
	*/
	private function set() {
		$this->table = DB_PRE . 'module_resource';
	}
	
	/**
	+-----------------------------------------------------------------------
	* 获取某模组资源信息
	+-----------------------------------------------------------------------
	* @mr_id         int or string    模组资源ID
	+-----------------------------------------------------------------------
	* 返回值         array or boolen  有则返回该模组资源数组,无则返回FASLE
	+-----------------------------------------------------------------------
	*/
	public function get_one($mr_id) {
		return $this->fetch("SELECT * FROM `" . $this->table . "` WHERE `mr_id`='" . $mr_id . "'");
	}
	
	/**
	+-----------------------------------------------------------------------
	* 模组资源列表
	+-----------------------------------------------------------------------
	* 参数     无
	+-----------------------------------------------------------------------
	* 返回值   array 模组资源数据
	+-----------------------------------------------------------------------
	*/
	public function list_info() {
		$this->count("SELECT COUNT(*) FROM " . $this->table);
		return $this->fetch_all("SELECT * FROM `{$this->table}` ORDER BY `list_order`,`mr_id` ASC" . $this->pagenation->sql_limit(), 'unbuffered');
	}
	
	/**
	+-----------------------------------------------------------------------
	* 增加新模组资源
	+-----------------------------------------------------------------------
	* @data    array    新增模组资源数据
	+-----------------------------------------------------------------------
	* 返回值   int      插入的ID
	+-----------------------------------------------------------------------
	*/
	public function add($data) {
		if(!$this->check_info($data)) { show_msg($this->msg(1)); }
		$data['add_time'] = now();
		$this->insert($this->table, $data);
		$insert_id = $this->last_insert_id();
		$this->cache_module_resource();
		return $insert_id;
	}
	
	/**
	+-----------------------------------------------------------------------
	* 验证要操作的新模组资源
	+-----------------------------------------------------------------------
	* @data    array    新增模组资源数据
	+-----------------------------------------------------------------------
	* 返回值   boolen   成功返回真,失败返回假
	+-----------------------------------------------------------------------
	*/
	public function check_info($data, $mr_id = '') {
		if(!preg_match('/^[A-Za-z\-_1-9]+$/', $data['mr_name'])) {
			$this->msg = 'mr_name_has_badword';
			return FALSE;
		}
		if(strlen($data['mr_name']) > 20) {
			$this->msg = 'mr_name_not_beyond_20_len';
			return FALSE;
		}
		$mr_data = array();
		$append_where = empty($mr_id) ? '' : " AND `mr_id`!='{$mr_id}'";
		$sql = "SELECT `mr_id` FROM {$this->table} WHERE `mr_name`='{$data['mr_name']}'" . $append_where;
		$mr_data = $this->fetch($sql);
		if(is_array($mr_data)) {
			$this->msg = 'mr_name_has_used';
			return FALSE;
		}
		unset($mr_data);
		return TRUE;
	}
	
	/**
	+-----------------------------------------------------------------------
	* 更新模组资源
	+-----------------------------------------------------------------------
	* @data    array    模组资源数据
	+-----------------------------------------------------------------------
	* 返回值   boolen   成功返回真
	+-----------------------------------------------------------------------
	*/
	public function edit($data, $mr_id) {
		if(!$this->check_info($data, $mr_id)) { show_msg($this->msg(1)); }
			$this->update($this->table, $data, "mr_id='" . $mr_id . "'");
			$this->cache_module_resource();
			return TRUE;
		}
		
	/**
	+-----------------------------------------------------------------------
	* 禁用与启用模组资源
	+-----------------------------------------------------------------------
	* @mr_id      int  要禁用的模组资源ID
	* @disabled_value  int  启用为0,禁用为1
	+-----------------------------------------------------------------------
	* 返回值                成功返回真
	+-----------------------------------------------------------------------
	*/
	public function disable($mr_id, $disabled_value) {
		$this->update($this->table, array('disabled' => $disabled_value), "mr_id='" . $mr_id . "'");
		$this->cache_module_resource();
		return TRUE;
	}
	
	/**
	+-----------------------------------------------------------------------
	* 删除模组资源
	+-----------------------------------------------------------------------
	* @mr_id      int    模组资源ID
	+-----------------------------------------------------------------------
	* 返回值                  成功返回真
	+-----------------------------------------------------------------------
	*/
	public function remove($mr_id) {
		$this->delete($this->table, "mr_id='" . $mr_id ."'");
		$this->cache_module_resource();
		return TRUE;
	}
	
	/**
	+-----------------------------------------------------------------------
	* 模组资源排序
	+-----------------------------------------------------------------------
	* @id_arr      array     表单提交的数组
	+-----------------------------------------------------------------------
	* 返回值       boolen    成功返回真，失败返回假
	+-----------------------------------------------------------------------
	*/
	public function list_order($id_arr) {
		if(!is_array($id_arr)) { return FALSE; }
		foreach($id_arr as $k => $v) {
			$this->update($this->table, array('list_order' => $v) , "mr_id='" . $k . "'");
		}
		$this->cache_module_resource();
		return TRUE;
	}
}
?>