<?php
/* 
 [QXDream] IdCodeAction.class.php 2011-02-27
*/

// ★ ------------------------------------------
// ↓ 作者      踏雪残情
// ★ ------------------------------------------
// ↓ 建立日期  2011-02-27
// ★ ------------------------------------------
// ↓ 更新日期  2011-02-27
// ★ ------------------------------------------
// ↓ 功能      验证码控制器
// ★ ------------------------------------------
// ↓ 版本      ver 1.0
// ★ ------------------------------------------

class IdCodeAction extends Controller {
	
	public function __construct() {
		$this->id_code = $this->load_model('IdCode');
	}
	
	public function output() {
		$this->id_code->set();
		$this->id_code->image_pic();
	}
	
}
?>